tiborsimon/embedded-tdd-headers/pic/pic18/pic18f83j11_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F83J11_H_
#define _PIC18F83J11_H_

#define RCSTA2                        0
#define RCD82                         1
#define RX9D2                         2
#define RCSTA2_RCD8                   3
#define RCSTA2_RX9D                   4
#define RCSTA2_OERR                   5
#define OERR2                         6
#define FERR2                         7
#define RCSTA2_FERR                   8
#define ADDEN2                        9
#define RCSTA2_ADDEN                  10
#define RCSTA2_CREN                   11
#define CREN2                         12
#define SREN2                         13
#define RCSTA2_SREN                   14
#define RC92                          15
#define RCSTA2_nRC8                   16
#define RC8_92                        17
#define RCSTA2_RX9                    18
#define RCSTA2_NOT_RC8                19
#define RCSTA2_RC9                    20
#define RCSTA2_RC8_9                  21
#define RX92                          22
#define RCSTA2_SPEN                   23
#define SPEN2                         24
#define TXSTA2                        25
#define TXSTA2_TXD8                   26
#define TX9D2                         27
#define TXSTA2_TX9D                   28
#define TXD82                         29
#define TRMT2                         30
#define TXSTA2_TRMT                   31
#define BRGH2                         32
#define TXSTA2_BRGH                   33
#define SENDB2                        34
#define TXSTA2_SYNC                   35
#define SYNC2                         36
#define TXEN2                         37
#define TXSTA2_TXEN                   38
#define TX8_92                        39
#define TX92                          40
#define TXSTA2_TX9                    41
#define TXSTA2_nTX8                   42
#define TXSTA2_NOT_TX8                43
#define TXSTA2_TX8_9                  44
#define TXSTA2_CSRC                   45
#define CSRC2                         46
#define CCP2CON                       47
#define CCP2M                         48
#define CCP2M0                        49
#define CCP2M1                        50
#define CCP2M2                        51
#define CCP2M3                        52
#define DC2B0                         53
#define DCCP2Y                        54
#define DC2B                          55
#define DC2B1                         56
#define DCCP2X                        57
#define CCP1CON                       58
#define CCP1M0                        59
#define CCP1M                         60
#define CCP1M1                        61
#define CCP1M2                        62
#define CCP1M3                        63
#define DCCP1Y                        64
#define DC1B                          65
#define DC1B0                         66
#define DCCP1X                        67
#define DC1B1                         68
#define BAUDCON1                      69
#define ABDEN                         70
#define ABDEN1                        71
#define WUE1                          72
#define WUE                           73
#define BRG16                         74
#define BRG161                        75
#define TXCKP                         76
#define SCKP                          77
#define TXCKP1                        78
#define SCKP1                         79
#define CKTXP                         80
#define DTRXP1                        81
#define RXDTP1                        82
#define RXDTP                         83
#define DTRXP                         84
#define RCIDL1                        85
#define RCMT                          86
#define RCMT1                         87
#define RCIDL                         88
#define ABDOVF                        89
#define ABDOVF1                       90
#define PORTA                         91
#define AN0                           92
#define ULPWUIN                       93
#define PORTA_RA0                     94
#define AN1                           95
#define PORTA_RA1                     96
#define AN2                           97
#define PORTA_RA2                     98
#define VREFM                         99
#define AN3                           100
#define PORTA_RA3                     101
#define VREFP                         102
#define PORTA_RA4                     103
#define T0CKI                         104
#define AN4                           105
#define PORTA_RA5                     106
#define LVDIN                         107
#define CLKO                          108
#define PORTA_RA6                     109
#define OSC2                          110
#define CLKI                          111
#define PORTA_RA7                     112
#define OSC1                          113
#define PORTA_RJPU                    114
#define PORTB                         115
#define INT0                          116
#define PORTB_RB0                     117
#define INT1                          118
#define PORTB_RB1                     119
#define INT2                          120
#define PORTB_RB2                     121
#define INT3                          122
#define CCP2_PA2                      123
#define PORTB_CCP2                    124
#define PORTB_RB3                     125
#define KBI0                          126
#define PORTB_RB4                     127
#define KBI1                          128
#define PORTB_RB5                     129
#define PGC                           130
#define KBI2                          131
#define PORTB_RB6                     132
#define PGD                           133
#define KBI3                          134
#define PORTB_RB7                     135
#define PORTC                         136
#define T13CKI                        137
#define T1OSO                         138
#define PORTC_RC0                     139
#define PORTC_CCP2                    140
#define T1OSI                         141
#define PORTC_RC1                     142
#define PA2                           143
#define CCP1                          144
#define PA1                           145
#define PORTC_RC2                     146
#define SCL                           147
#define SCK                           148
#define PORTC_RC3                     149
#define SDA                           150
#define SDI                           151
#define PORTC_RC4                     152
#define SDO                           153
#define PORTC_RC5                     154
#define PORTC_RC6                     155
#define TX1                           156
#define CK1                           157
#define RX1                           158
#define DT1                           159
#define PORTC_RC7                     160
#define PORTD                         161
#define PSP0                          162
#define PORTD_RD0                     163
#define AD0                           164
#define PSP1                          165
#define PORTD_RD1                     166
#define AD1                           167
#define PSP2                          168
#define AD2                           169
#define PORTD_RD2                     170
#define PSP3                          171
#define AD3                           172
#define PORTD_RD3                     173
#define PORTD_RD4                     174
#define PSP4                          175
#define AD4                           176
#define PSP5                          177
#define AD5                           178
#define PORTD_RD5                     179
#define PSP6                          180
#define AD6                           181
#define PORTD_RD6                     182
#define SS2                           183
#define PSP7                          184
#define AD7                           185
#define PORTD_RD7                     186
#define PORTE                         187
#define PD2                           188
#define AD8                           189
#define RD                            190
#define RDE                           191
#define PORTE_RE0                     192
#define AD9                           193
#define PORTE_WR                      194
#define WRE                           195
#define PORTE_RE1                     196
#define PC2                           197
#define CS                            198
#define CCP10                         199
#define PB2                           200
#define PORTE_RE2                     201
#define AD10                          202
#define PORTE_RE3                     203
#define CCP9E                         204
#define AD11                          205
#define PC3E                          206
#define PORTE_RE4                     207
#define PB3E                          208
#define AD12                          209
#define CCP8E                         210
#define PORTE_RE5                     211
#define CCP7E                         212
#define AD13                          213
#define PC1E                          214
#define CCP6E                         215
#define PORTE_RE6                     216
#define AD14                          217
#define PB1E                          218
#define PORTE_CCP2                    219
#define CCP2E                         220
#define PA2E                          221
#define PORTE_RE7                     222
#define AD15                          223
#define PORTF                         224
#define PORTF_RF1                     225
#define C2OUTF                        226
#define AN6                           227
#define PORTF_C2OUT                   228
#define AN7                           229
#define C1OUTF                        230
#define PORTF_C1OUT                   231
#define PORTF_RF2                     232
#define PORTF_RF3                     233
#define AN8                           234
#define C2INB                         235
#define PORTF_RF4                     236
#define AN9                           237
#define C2INA                         238
#define C1INB                         239
#define PORTF_RF5                     240
#define CVREF                         241
#define AN10                          242
#define C1INA                         243
#define PORTF_RF6                     244
#define AN11                          245
#define PORTF_RF7                     246
#define SS1                           247
#define AN5                           248
#define PORTG                         249
#define PORTG_RG0                     250
#define C3OUTG                        251
#define TX2                           252
#define CK2                           253
#define PORTG_RG1                     254
#define PORTG_RG2                     255
#define DT2                           256
#define RX2                           257
#define PORTG_RG3                     258
#define PORTG_RG4                     259
#define RG5                           260
#define PORTG_RJPU                    261
#define RG6                           262
#define REPU                          263
#define RG7                           264
#define RDPU                          265
#define PORTH                         266
#define PORTH_RH0                     267
#define A16                           268
#define PORTH_RH1                     269
#define A17                           270
#define PORTH_RH2                     271
#define A18                           272
#define PORTH_RH3                     273
#define A19                           274
#define PORTH_RH4                     275
#define CCP9                          276
#define PC3                           277
#define PORTH_RH5                     278
#define CCP8                          279
#define PB3                           280
#define PORTH_RH6                     281
#define CCP7                          282
#define PC1                           283
#define PORTH_RH7                     284
#define CCP6                          285
#define PB1                           286
#define PORTJ                         287
#define ALE                           288
#define PORTJ_RJ0                     289
#define OE                            290
#define PORTJ_RJ1                     291
#define WRL                           292
#define PORTJ_RJ2                     293
#define WRH                           294
#define PORTJ_RJ3                     295
#define BA0                           296
#define PORTJ_RJ4                     297
#define CE                            298
#define PORTJ_RJ5                     299
#define LB                            300
#define PORTJ_RJ6                     301
#define PORTJ_RJ7                     302
#define UB                            303
#define LATA                          304
#define LATA0                         305
#define LA0                           306
#define LATA1                         307
#define LA1                           308
#define LATA2                         309
#define LA2                           310
#define LATA3                         311
#define LA3                           312
#define LATA4                         313
#define LA4                           314
#define LATA5                         315
#define LA5                           316
#define LATA6                         317
#define LA6                           318
#define LATA7                         319
#define LA7                           320
#define LATB                          321
#define LB0                           322
#define LATB0                         323
#define LB1                           324
#define LATB1                         325
#define LB2                           326
#define LATB2                         327
#define LB3                           328
#define LATB3                         329
#define LB4                           330
#define LATB4                         331
#define LB5                           332
#define LATB5                         333
#define LB6                           334
#define LATB6                         335
#define LB7                           336
#define LATB7                         337
#define LATC                          338
#define LATC0                         339
#define LC0                           340
#define LATC1                         341
#define LC1                           342
#define LATC2                         343
#define LC2                           344
#define LATC3                         345
#define LC3                           346
#define LATC4                         347
#define LC4                           348
#define LATC5                         349
#define LC5                           350
#define LATC6                         351
#define LC6                           352
#define LATC7                         353
#define LC7                           354
#define LATD                          355
#define LATD0                         356
#define LD0                           357
#define LATD1                         358
#define LD1                           359
#define LATD2                         360
#define LD2                           361
#define LATD3                         362
#define LD3                           363
#define LATD4                         364
#define LD4                           365
#define LATD5                         366
#define LD5                           367
#define LATD6                         368
#define LD6                           369
#define LATD7                         370
#define LD7                           371
#define LATE                          372
#define LATE0                         373
#define LE0                           374
#define LATE1                         375
#define LE1                           376
#define LATE2                         377
#define LE2                           378
#define LATE3                         379
#define LE3                           380
#define LATE4                         381
#define LE4                           382
#define LATE5                         383
#define LE5                           384
#define LATE6                         385
#define LE6                           386
#define LATE7                         387
#define LE7                           388
#define LATF                          389
#define LATF1                         390
#define LF1                           391
#define LF2                           392
#define LATF2                         393
#define LF3                           394
#define LATF3                         395
#define LF4                           396
#define LATF4                         397
#define LF5                           398
#define LATF5                         399
#define LF6                           400
#define LATF6                         401
#define LF7                           402
#define LATF7                         403
#define LATG                          404
#define LATG0                         405
#define LG0                           406
#define LATG1                         407
#define LG1                           408
#define LG2                           409
#define LATG2                         410
#define LATG3                         411
#define LG3                           412
#define LATG4                         413
#define LG4                           414
#define U1OD                          415
#define U2OD                          416
#define LATH                          417
#define LH0                           418
#define LATH0                         419
#define LH1                           420
#define LATH1                         421
#define LH2                           422
#define LATH2                         423
#define LH3                           424
#define LATH3                         425
#define LH4                           426
#define LATH4                         427
#define LH5                           428
#define LATH5                         429
#define LH6                           430
#define LATH6                         431
#define LH7                           432
#define LATH7                         433
#define LATJ                          434
#define LATJ0                         435
#define LJ0                           436
#define LATJ1                         437
#define LJ1                           438
#define LATJ2                         439
#define LJ2                           440
#define LATJ3                         441
#define LJ3                           442
#define LATJ4                         443
#define LJ4                           444
#define LATJ5                         445
#define LJ5                           446
#define LATJ6                         447
#define LJ6                           448
#define LATJ7                         449
#define LJ7                           450
#define TRISA                         451
#define TRISA0                        452
#define TRISA_RA0                     453
#define TRISA1                        454
#define TRISA_RA1                     455
#define TRISA2                        456
#define TRISA_RA2                     457
#define TRISA3                        458
#define TRISA_RA3                     459
#define TRISA_RA4                     460
#define TRISA4                        461
#define TRISA_RA5                     462
#define TRISA5                        463
#define TRISA_RA6                     464
#define TRISA6                        465
#define TRISA_RA7                     466
#define TRISA7                        467
#define TRISB                         468
#define TRISB_RB0                     469
#define TRISB0                        470
#define TRISB_RB1                     471
#define TRISB1                        472
#define TRISB_RB2                     473
#define TRISB2                        474
#define TRISB_RB3                     475
#define TRISB3                        476
#define TRISB_RB4                     477
#define TRISB4                        478
#define TRISB_RB5                     479
#define TRISB5                        480
#define TRISB_RB6                     481
#define TRISB6                        482
#define TRISB_RB7                     483
#define TRISB7                        484
#define TRISC                         485
#define TRISC0                        486
#define TRISC_RC0                     487
#define TRISC1                        488
#define TRISC_RC1                     489
#define TRISC2                        490
#define TRISC_RC2                     491
#define TRISC3                        492
#define TRISC_RC3                     493
#define TRISC4                        494
#define TRISC_RC4                     495
#define TRISC5                        496
#define TRISC_RC5                     497
#define TRISC6                        498
#define TRISC_RC6                     499
#define TRISC7                        500
#define TRISC_RC7                     501
#define TRISD                         502
#define TRISD_RD0                     503
#define TRISD0                        504
#define TRISD_RD1                     505
#define TRISD1                        506
#define TRISD_RD2                     507
#define TRISD2                        508
#define TRISD_RD3                     509
#define TRISD3                        510
#define TRISD_RD4                     511
#define TRISD4                        512
#define TRISD_RD5                     513
#define TRISD5                        514
#define TRISD_RD6                     515
#define TRISD6                        516
#define TRISD_RD7                     517
#define TRISD7                        518
#define TRISE                         519
#define TRISE_RE0                     520
#define TRISE0                        521
