tiborsimon/embedded-tdd-headers/pic/pic18/pic18f83j11_tdd.h
#define TRISE1                        522
#define TRISE_RE1                     523
#define TRISE2                        524
#define TRISE_RE2                     525
#define TRISE_RE3                     526
#define TRISE3                        527
#define TRISE_RE4                     528
#define TRISE4                        529
#define TRISE_RE5                     530
#define TRISE5                        531
#define TRISE_RE6                     532
#define TRISE6                        533
#define TRISE_RE7                     534
#define TRISE7                        535
#define TRISF                         536
#define TRISF_RF1                     537
#define TRISF1                        538
#define TRISF2                        539
#define TRISF_RF2                     540
#define TRISF_RF3                     541
#define TRISF3                        542
#define TRISF_RF4                     543
#define TRISF4                        544
#define TRISF_RF5                     545
#define TRISF5                        546
#define TRISF_RF6                     547
#define TRISF6                        548
#define TRISF7                        549
#define TRISF_RF7                     550
#define TRISG                         551
#define TRISG0                        552
#define TRISG_RG0                     553
#define TRISG1                        554
#define TRISG_RG1                     555
#define TRISG2                        556
#define TRISG_RG2                     557
#define TRISG_RG3                     558
#define TRISG3                        559
#define TRISG4                        560
#define TRISG_RG4                     561
#define CCP1OD                        562
#define CCP2OD                        563
#define SPIOD                         564
#define TRISH                         565
#define TRISH_RH0                     566
#define TRISH0                        567
#define TRISH_RH1                     568
#define TRISH1                        569
#define TRISH_RH2                     570
#define TRISH2                        571
#define TRISH_RH3                     572
#define TRISH3                        573
#define TRISH_RH4                     574
#define TRISH4                        575
#define TRISH_RH5                     576
#define TRISH5                        577
#define TRISH_RH6                     578
#define TRISH6                        579
#define TRISH_RH7                     580
#define TRISH7                        581
#define TRISJ                         582
#define TRISJ_RJ0                     583
#define TRISJ0                        584
#define TRISJ_RJ1                     585
#define TRISJ1                        586
#define TRISJ_RJ2                     587
#define TRISJ2                        588
#define TRISJ_RJ3                     589
#define TRISJ3                        590
#define TRISJ_RJ4                     591
#define TRISJ4                        592
#define TRISJ_RJ5                     593
#define TRISJ5                        594
#define TRISJ_RJ6                     595
#define TRISJ6                        596
#define TRISJ_RJ7                     597
#define TRISJ7                        598
#define OSCTUNE                       599
#define TUN0                          600
#define TUN1                          601
#define TUN2                          602
#define TUN3                          603
#define TUN4                          604
#define TUN5                          605
#define PLLEN                         606
#define INTSRC                        607
#define MEMCON                        608
#define WM                            609
#define WM0                           610
#define WM1                           611
#define WAIT0                         612
#define WAIT                          613
#define WAIT1                         614
#define EBDIS                         615
#define PIE1                          616
#define TMR1IE                        617
#define TMR2IE                        618
#define SSPIE                         619
#define SSP1IE                        620
#define TXIE                          621
#define TX1IE                         622
#define RCIE                          623
#define RC1IE                         624
#define ADIE                          625
#define PSPIE                         626
#define PIR1                          627
#define TMR1IF                        628
#define TMR2IF                        629
#define SSP1IF                        630
#define SSPIF                         631
#define TXIF                          632
#define TX1IF                         633
#define RCIF                          634
#define RC1IF                         635
#define ADIF                          636
#define PSPIF                         637
#define IPR1                          638
#define TMR1IP                        639
#define TMR2IP                        640
#define SSPIP                         641
#define SSP1IP                        642
#define TX1IP                         643
#define TXIP                          644
#define RCIP                          645
#define RC1IP                         646
#define ADIP                          647
#define PSPIP                         648
#define PIE2                          649
#define TMR3IE                        650
#define LVDIE                         651
#define BCLIE                         652
#define BCL1IE                        653
#define CMIE                          654
#define OSCFIE                        655
#define PIR2                          656
#define TMR3IF                        657
#define LVDIF                         658
#define BCL1IF                        659
#define BCLIF                         660
#define CMIF                          661
#define OSCFIF                        662
#define IPR2                          663
#define TMR3IP                        664
#define LVDIP                         665
#define BCL1IP                        666
#define BCLIP                         667
#define CMIP                          668
#define OSCFIP                        669
#define PIE3                          670
#define RXBNIE                        671
#define CCP1IE                        672
#define RXB1IE                        673
#define CCP2IE                        674
#define TXB0IE                        675
#define TXB2IE                        676
#define TXBNIE                        677
#define TX2IE                         678
#define RC2IE                         679
#define PIR3                          680
#define RXBNIF                        681
#define CCP1IF                        682
#define CCP2IF                        683
#define TXBNIF                        684
#define TX2IF                         685
#define RC2IF                         686
#define IPR3                          687
#define RXBNIP                        688
#define CCP1IP                        689
#define CCP2IP                        690
#define TX2IP                         691
#define TXBNIP                        692
#define RC2IP                         693
#define EECON1                        694
#define EECON1_WR                     695
#define WREN                          696
#define WRERR                         697
#define FREE                          698
#define RCSTA1                        699
#define RCSTA1_RX9D                   700
#define RX9D1                         701
#define RCSTA1_RCD8                   702
#define RCSTA1_OERR                   703
#define OERR1                         704
#define RCSTA1_FERR                   705
#define FERR1                         706
#define RCSTA1_ADDEN                  707
#define ADDEN1                        708
#define RCSTA1_CREN                   709
#define CREN1                         710
#define SRENA                         711
#define SREN1                         712
#define RCSTA1_SREN                   713
#define RCSTA1_NOT_RC8                714
#define RCSTA1_RC9                    715
#define RCSTA1_nRC8                   716
#define RCSTA1_RC8_9                  717
#define RCSTA1_RX9                    718
#define RX91                          719
#define RCSTA1_SPEN                   720
#define SPEN1                         721
#define TXSTA1                        722
#define TX9D1                         723
#define TXSTA1_TX9D                   724
#define TXSTA1_TXD8                   725
#define TRMT1                         726
#define TXSTA1_TRMT                   727
#define BRGH1                         728
#define TXSTA1_BRGH                   729
#define SENDB1                        730
#define SENDB                         731
#define TXSTA1_SYNC                   732
#define SYNC1                         733
#define TXEN1                         734
#define TXSTA1_TXEN                   735
#define TX91                          736
#define TXSTA1_NOT_TX8                737
#define TXSTA1_TX8_9                  738
#define TXSTA1_TX9                    739
#define TXSTA1_nTX8                   740
#define TXSTA1_CSRC                   741
#define CSRC1                         742
#define PSPCON                        743
#define PSPMODE                       744
#define IBOV                          745
#define OBF                           746
#define IBF                           747
#define T3CON                         748
#define TMR3ON                        749
#define TMR3CS                        750
#define nT3SYNC                       751
#define NOT_T3SYNC                    752
#define T3SYNC                        753
#define T3INSYNC                      754
#define SOSCEN3                       755
#define T3CCP1                        756
#define T3CKPS                        757
#define T3CKPS0                       758
#define T3CKPS1                       759
#define T3CCP2                        760
#define T3CON_RD16                    761
#define RD163                         762
#define T3RD16                        763
#define CMCON                         764
#define CMEN0                         765
#define CMCON_CM                      766
#define CM0                           767
#define CMEN1                         768
#define CM1                           769
#define CMEN2                         770
#define CM2                           771
#define CIS                           772
#define C1INV                         773
#define C2INV                         774
#define CMCON_C1OUT                   775
#define CMCON_C2OUT                   776
#define CVRCON                        777
#define CVR                           778
#define CVR0                          779
#define CVR1                          780
#define CVR2                          781
#define CVR3                          782
#define CVRSS                         783
#define CVRR                          784
#define CVROEN                        785
#define CVROE                         786
#define CVREN                         787
#define ADCON2                        788
#define ADCS0                         789
#define ADCS                          790
#define ADCS1                         791
#define ADCS2                         792
#define ACQT0                         793
#define ACQT                          794
#define ACQT1                         795
#define ACQT2                         796
#define ADFM                          797
#define ADCON1                        798
#define PCFG0                         799
#define PCFG                          800
#define PCFG1                         801
#define PCFG2                         802
#define CHSN3                         803
#define PCFG3                         804
#define VCFG                          805
#define VCFG0                         806
#define VCFG01                        807
#define VCFG11                        808
#define VCFG1                         809
#define ADCON0                        810
#define ADON                          811
#define nDONE                         812
#define GO_nDONE                      813
#define NOT_DONE                      814
#define GODONE                        815
#define GO_DONE                       816
#define DONE                          817
#define GO                            818
#define GO_NOT_DONE                   819
#define CHS                           820
#define CHS0                          821
#define CHS1                          822
#define CHS2                          823
#define CHS3                          824
#define ADCAL                         825
#define SSPCON2                       826
#define SEN1                          827
#define SEN                           828
#define ADMSK11                       829
#define RSEN1                         830
#define RSEN                          831
#define ADMSK1                        832
#define PEN                           833
#define ADMSK21                       834
#define PEN1                          835
#define ADMSK2                        836
#define ADMSK31                       837
#define RCEN                          838
#define RCEN1                         839
#define ADMSK3                        840
#define ACKEN                         841
#define ACKEN1                        842
#define ADMSK41                       843
#define ADMSK4                        844
#define ACKDT1                        845
#define ADMSK51                       846
#define ADMSK5                        847
#define ACKDT                         848
#define ACKSTAT                       849
#define ACKSTAT1                      850
#define GCEN                          851
#define GCEN1                         852
#define SSPCON1                       853
#define SSPM0                         854
#define SSPM                          855
#define SSPM01                        856
#define SSPM1                         857
#define SSPM11                        858
#define SSPM2                         859
#define SSPM21                        860
#define SSPM31                        861
#define SSPM3                         862
#define CKP                           863
#define CKP1                          864
#define SSPEN                         865
#define SSPEN1                        866
#define SSPOV1                        867
#define SSPOV                         868
#define WCOL1                         869
#define WCOL                          870
#define SSPSTAT                       871
#define BF                            872
#define BF1                           873
#define UA1                           874
#define UA                            875
#define R_NOT_W                       876
#define READ_WRITE                    877
#define RW1                           878
#define NOT_W                         879
#define I2C_READ                      880
#define nW                            881
#define RW                            882
#define nWRITE                        883
#define R                             884
#define NOT_WRITE                     885
#define R_nW                          886
#define R_W                           887
#define START                         888
#define START1                        889
#define S                             890
#define I2C_START                     891
#define STOP                          892
#define STOP1                         893
#define I2C_STOP                      894
#define P                             895
#define NOT_A                         896
#define nA                            897
#define D_A                           898
#define D_nA                          899
#define D                             900
#define DA1                           901
#define DA                            902
#define DATA_ADDRESS                  903
#define D_NOT_A                       904
#define NOT_ADDRESS                   905
#define nADDRESS                      906
#define I2C_DAT                       907
#define CKE                           908
#define CKE1                          909
#define SMP                           910
#define SMP1                          911
#define SSPADD                        912
#define MSK01                         913
#define MSK0                          914
#define MSK11                         915
#define MSK1                          916
#define MSK21                         917
#define MSK2                          918
#define MSK3                          919
#define MSK31                         920
#define MSK4                          921
#define MSK41                         922
#define MSK51                         923
#define MSK5                          924
#define MSK61                         925
#define MSK6                          926
#define MSK71                         927
#define MSK7                          928
#define T2CON                         929
#define T2CKPS0                       930
#define T2CKPS                        931
#define T2CKPS1                       932
#define TMR2ON                        933
#define T2OUTPS0                      934
#define T2OUTPS                       935
#define T2OUTPS1                      936
#define T2OUTPS2                      937
#define T2OUTPS3                      938
#define T1CON                         939
#define TMR1ON                        940
#define TMR1CS                        941
#define NOT_T1SYNC                    942
#define T1SYNC                        943
#define nT1SYNC                       944
#define T1INSYNC                      945
#define T1OSCEN                       946
#define SOSCEN                        947
#define T1CKPS0                       948
#define T1CKPS                        949
#define T1CKPS1                       950
#define T1RUN                         951
#define T1RD16                        952
#define T1CON_RD16                    953
#define RCON                          954
#define BOR                           955
#define NOT_BOR                       956
#define nBOR                          957
#define POR                           958
#define nPOR                          959
#define NOT_POR                       960
#define PD                            961
#define nPD                           962
#define NOT_PD                        963
#define nTO                           964
#define TO                            965
#define NOT_TO                        966
#define nRI                           967
#define NOT_RI                        968
#define RI                            969
#define NOT_CM                        970
#define RCON_CM                       971
#define nCM                           972
#define IPEN                          973
#define WDTCON                        974
#define SWDTE                         975
#define SWDTEN                        976
#define REGSLP                        977
#define OSCCON                        978
#define SCS0                          979
#define SCS                           980
#define SCS1                          981
#define IOFS                          982
#define OSTS                          983
#define IRCF                          984
#define IRCF0                         985
#define IRCF1                         986
#define IRCF2                         987
#define IDLEN                         988
#define T0CON                         989
#define T0PS                          990
#define T0PS0                         991
#define T0PS1                         992
#define T0PS2                         993
#define PSA                           994
#define T0PS3                         995
#define T0SE                          996
#define T0CS                          997
#define T08BIT                        998
#define TMR0ON                        999
#define STATUS                        1000
#define C                             1001
#define CARRY                         1002
#define DC                            1003
#define ZERO                          1004
#define Z                             1005
#define OV                            1006
#define OVERFLOW                      1007
#define N                             1008
#define NEGATIVE                      1009
#define INTCON3                       1010
#define INT1IF                        1011
#define INT1F                         1012
#define INT2IF                        1013
#define INT2F                         1014
#define INT3F                         1015
#define INT3IF                        1016
#define INT1E                         1017
#define INT1IE                        1018
#define INT2IE                        1019
#define INT2E                         1020
#define INT3E                         1021
#define INT3IE                        1022
#define INT1P                         1023
#define INT1IP                        1024
#define INT2IP                        1025
#define INT2P                         1026
#define INTCON2                       1027
#define RBIP                          1028
#define INT3IP                        1029
#define INT3P                         1030
#define TMR0IP                        1031
#define T0IP                          1032
#define INTEDG3                       1033
#define INTEDG2                       1034
#define INTEDG1                       1035
#define INTEDG0                       1036
#define RBPU                          1037
#define NOT_RBPU                      1038
#define nRBPU                         1039
#define INTCON                        1040
#define RBIF                          1041
#define INT0F                         1042
#define INT0IF                        1043
#define T0IF                          1044
#define TMR0IF                        1045
#define RBIE                          1046
#define INT0E                         1047
#define INT0IE                        1048
#define T0IE                          1049
#define TMR0IE                        1050
#define PEIE                          1051
#define PEIE_GIEL                     1052
#define GIEL                          1053
#define GIE_GIEH                      1054
#define GIE                           1055
#define GIEH                          1056
#define SP0                           1057
#define STKPTR                        1058
#define STKPTR0                       1059
#define SP1                           1060
#define STKPTR1                       1061
#define STKPTR2                       1062
#define SP2                           1063
#define SP3                           1064
#define STKPTR3                       1065
#define STKPTR4                       1066
#define SP4                           1067
#define STKUNF                        1068
#define STKOVF                        1069
#define STKFUL                        1070

#endif // _PIC18F83J11_H_
